Documents/УстановкаИндивидуальныхЦенМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаИндивидуальныхЦенМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ЦеныПараметровПродукцииИндивидуальные</xr:Item>
				<xr:Item>InformationRegister.ЦеныМатериаловИндивидуальные</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийУстановкиИндивидуальныхЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПродукции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаСФотопечатьюОтличается</Name>
					<Comment>#12615</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УДАЛИТЬ_ВидыНоменклатурыПотолка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фактура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаСФотопечатью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Comment>#7256</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦеныСФотопечатью</Name>
							<Comment>#7256</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаценкаСФотопечатью</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЦеныМатериаловИндивидуальные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериаловИндивидуальные</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦены</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦеныСФотопечатью</Name>
					<Comment>#7256</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отменена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныМатериалов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаСФотопечатью</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фактура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фактура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦветФактуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПродукции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СпособыОпределенияСтоимостиПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыОпределенияСтоимостиПродукции</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПараметрам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоШаблону</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийУстановкиИндивидуальныхЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОперацийУстановкиИндивидуальныхЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Установка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отмена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВидыПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыПродукции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальнаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОпределенияСтоимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОпределенияСтоимостиПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>УчитываемыеПараметрыПродукции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПараметрПродукции</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/УстановкаИндивидуальныхЦенМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Ключ.Пустая() Тогда
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);
	
	УстановкаЦенСервер.ЗаполнитьИспользуемыеВидыЦенПользователя(ЭтаФорма);
	
	УправлениеФормой();
	
	УстановитьУсловноеОформление();
	
	Элементы.ВидНоменклатуры.СписокВыбора.Очистить();
	Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.Продукция);
	Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.Отрез);
	Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.Потолок);
	// №12232 Элементы.ВидНоменклатуры.СписокВыбора.Добавить(Справочники.ВидыНоменклатуры.ТиповойОтрез);
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораФактуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораШаблоновПродукции" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	ВалютаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВалютаПриИзмененииНаСервере()
	
	ФинансыСервер.ОбновитьВидимостьИКурсВалюты(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	Объект.ДоговорКонтрагента = Объект.Контрагент.ОсновнойДоговор;
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//++ 16338
	// СтандартнаяОбработка = Ложь;
	//-- 16338
	СтарыйВидНоменклатуры = Объект.ВидНоменклатуры;
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзменении(Элемент)
	
	Если НЕ СтарыйВидНоменклатуры = Объект.ВидНоменклатуры
		//И (СтарыйВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция")
		//	ИЛИ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция")) 
			Тогда
		Если Объект.Материалы.Количество() > 0 Тогда
			ТекстВопроса = "Табличная часть с ценами будет очищена. Продолжить?";
			ОписаниеОповещения = Новый ОписаниеОповещения("ВидНоменклатурыПриИзмененииФрагмент", ЭтотОбъект);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		Иначе
			ВидНоменклатурыПриИзмененииЗавершение();
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзмененииФрагмент(Результат, ДополнительныеПарраметры) Экспорт
	
	Если Не Результат = КодВозвратаДиалога.Да Тогда
		Объект.ВидНоменклатуры = СтарыйВидНоменклатуры; 		
	Иначе 
		Объект.Материалы.Очистить();
		ВидНоменклатурыПриИзмененииЗавершение();		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ВидНоменклатурыПриИзмененииЗавершение() 
	
	Если НЕ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		Объект.ВидПродукции = ПредопределенноеЗначение("Справочник.ВидыПродукции.ПустаяСсылка");
		Объект.СпособОпределенияСтоимости = ПредопределенноеЗначение("Перечисление.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка");
	КонецЕсли;
	
	УправлениеФормой();		
		
КонецПроцедуры

&НаКлиенте
Процедура ЦенаСФотопечатьюОтличаетсяПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПродукцииПриИзменении(Элемент)
	
	Объект.Материалы.Очистить();		
	ВидПродукцииПриИзмененииНаСервере();
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура ВидПродукцииПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидПродукции) Тогда
		Объект.СпособОпределенияСтоимости = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ВидПродукции, "СпособОпределенияСтоимости");
		Если Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам Тогда
			Для каждого СтрокаТЧ из Объект.ВидПродукции.УчитываемыеПараметрыПродукции Цикл
				НоваяСтрока = Объект.Материалы.Добавить();
	       		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
			КонецЦикла;
		КонецЕсли;
	Иначе	
		Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийВкладкиЦеныНаПродукцию
//#7256 

&НаКлиенте
Процедура ПодобратьМатериалы(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораФактуры(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьШаблоны(Команда)
	
	ПараметрыПодбора = Новый Структура;
	УстановкаЦенКлиент.ОткрытьФормуПодбораШаблонов(ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаДанныхПодбора = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	Если ЭтоПотолокОтрез Тогда
		УстановкаЦенСервер.ОбработкаВыбораПодбораФактуры(ТаблицаДанныхПодбора, Объект.Материалы);
	ИначеЕсли ЭтоПродукция Тогда
		УстановкаЦенСервер.ОбработкаВыбораПодбораШаблонов(ТаблицаДанныхПодбора, Объект.Материалы);
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочнику(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуФактур(ЭтаФорма, Объект.Материалы); //, Новый Структура("КлючСвязи", ТекущиеДанные.КлючСвязи));
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуФактурЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
	
   	ЗаполнитьМатериалыПоСправочникуФактурНаСервере(ДополнительныеПараметры.ДополнительныеПараметрыЗаполнения);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоСправочникуФактурНаСервере(ДополнительныеПараметрыЗаполнения)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, , ДополнительныеПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСправочникуШаблонов(Команда)
	
	УстановкаЦенКлиент.ЗаполнитьМатериалыПоСправочникуШаблонов(ЭтаФорма, Объект.Материалы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоСправочникуШаблоновЗавершение(Результат, Параметры) Экспорт
	
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьПоСправочникуШаблоновНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСправочникуШаблоновНаСервере()
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуШаблонов(Объект.Материалы, Объект.ВидПродукции);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеСправочника(Команда)
		
	Если ЭтоПотолокОтрез Тогда
		УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеФактур(ЭтаФорма, Объект.Материалы);
	ИначеЕсли ЭтоПродукция Тогда
		УстановкаЦенКлиент.ЗаполнитьМатериалыПоГруппеШаблонов(ЭтаФорма, Объект.Материалы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеФактурПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьМатериалыПоГруппеНаСервере(ВыбранноеЗначение, ДополнительныеПараметры);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМатериалыПоГруппеНаСервере(ГруппаФактур, ДополнительныеПараметрыЗаполнения)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуФактур(Объект.Материалы, ГруппаФактур, ДополнительныеПараметрыЗаполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМатериалыПоГруппеШаблоновПослеВыбораГруппы(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоГруппеШаблоновНаСервере(ВыбранноеЗначение);
    
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоГруппеШаблоновНаСервере(ГруппаШаблонов)
	
	УстановкаЦенСервер.ЗаполнитьМатериалыПоСправочникуШаблонов(Объект.Материалы, Объект.ВидПродукции, ГруппаШаблонов);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныМатериаловТекущимиЦенами(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Сообщить("Не указан контрагент или договор контрагента");
		Возврат;
	КонецЕсли;
	
	Если Объект.Материалы.Количество() = 0 Тогда
		Сообщить ("Табличная часть пустая");
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("ЗаполнитьЦеныМатериаловТекущимиЦенамиЗавершение", ЭтаФорма); //, СтруктураОтбораСтрок);
	ПоказатьВопрос(ОписаниеОповещенияВопрос, "Очистить цены и заполнить текущими значениями?", РежимДиалогаВопрос.ДаНет);	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦеныМатериаловТекущимиЦенамиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
    Если НЕ Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;

    ЗаполнитьЦеныМатериаловТекущимиЦенамиНаСервере(ДополнительныеПараметры);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныМатериаловТекущимиЦенамиНаСервере(СтруктураОтбораСтрок)
	
	//ДатаЦены = Объект.Дата;
	//Если ДатаЦены = Дата(1,1,1) Тогда
	//	ДатаЦены = ТекущаяДатаСеанса();
	//КонецЕсли;
	
	КоллекцияДанных = Объект.Материалы; //.НайтиСтроки(СтруктураОтбораСтрок);
	Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
		ТекущаяСтрока.Цена 				= 0;
		ТекущаяСтрока.ЦенаСФотопечатью  = 0;
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",			Объект.Контрагент);
	Запрос.УстановитьПараметр("ДоговорКонтрагента", Объект.ДоговорКонтрагента);
	Запрос.УстановитьПараметр("Дата", 				ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Валюта", 			Объект.Валюта);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныМатериалов.Фактура КАК Фактура,
	|	ЦеныМатериалов.ЦветФактуры КАК ЦветФактуры,
	|	ЦеныМатериалов.Шаблон КАК Шаблон,
	|	ЦеныМатериалов.Цена КАК Цена,
	|	ЦеныМатериалов.ЦенаСФотопечатью КАК ЦенаСФотопечатью,
	|	ЦеныМатериалов.Отменена КАК Отменена
	|ИЗ
	|	РегистрСведений.ЦеныМатериаловИндивидуальные.СрезПоследних(
	|			&Дата,
	|			Валюта = &Валюта
	|				И Контрагент = &Контрагент
	|				И ДоговорКонтрагента = &ДоговорКонтрагента) КАК ЦеныМатериалов";
	
	ТаблицаЦен = Запрос.Выполнить().Выгрузить();
	
	СтруктураОтбора = Новый Структура("Фактура, ЦветФактуры");
	Если ЭтоПродукция Тогда
		СтруктураОтбора = Новый Структура("Шаблон");
	КонецЕсли;
	Для Каждого ТекущаяСтрока Из КоллекцияДанных Цикл
		ЗаполнитьЗначенияСвойств(СтруктураОтбора, ТекущаяСтрока);
		НайденныеСтроки = ТаблицаЦен.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Если НЕ НайденныеСтроки[0].Отменена Тогда
				ТекущаяСтрока.Цена = НайденныеСтроки[0].Цена;			
				ТекущаяСтрока.ЦенаСФотопечатью = НайденныеСтроки[0].ЦенаСФотопечатью;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦенуНаМатериалы(Команда)
	
	Если Объект.Материалы.Количество() = 0 Тогда
		Сообщить ("Табличная часть пустая");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = ?(НЕ ЭтоПродукция, "Установить общую цену на все фактуры и цвета?", "Установить общую цену на все шаблоны?");
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Объект.Материалы, , ТекстВопроса, , ЭтоПотолокОтрез);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщуюЦенуСФотопечатьюНаМатериалы(Команда)
	
	//ТекущиеДанные = Элементы.ВидыНоменклатурыПотолка.ТекущиеДанные;
	//Если ТекущиеДанные = Неопределено Тогда
	//	Сообщить("Не выбран вид номенклатуры потолка!");
	//	Возврат;
	//КонецЕсли;
	
	УстановкаЦенКлиент.УстановитьОбщуюЦенуНаМатериалы(Объект.Материалы, , "Установить общую цену на все фактуры и цвета с фотопечатью?", Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦеныМатериаловНаПроцент(Команда)
		
	Если Объект.Материалы.Количество() = 0 Тогда
		Сообщить ("Табличная часть пустая");
		Возврат;
	КонецЕсли;
	
	ТекстВопроса = ?(НЕ ЭтоПродукция, "Изменить цены на процент на все фактуры и цвета?", "Изменить цены на процент на все шаблоны?");
	УстановкаЦенКлиент.ИзменитьЦеныМатериаловНаПроцент(Объект.Материалы, , , ТекстВопроса);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьЦеныМатериаловНаСумму(Команда)
		
	Если Объект.Материалы.Количество() = 0 Тогда
		Сообщить ("Табличная часть пустая");
		Возврат;
	КонецЕсли;
	
	УстановкаЦенКлиент.ИзменитьЦеныМатериаловНаСумму(ЭтаФорма, Объект.Материалы, , , Объект.ВидНоменклатуры, Объект.ЦенаСФотопечатьюОтличается);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкруглитьЦены(Команда)

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораПравилОкругления", ЭтотОбъект);
	ПараметрыФормы = Новый Структура("ТипВладельца", "УстановкаЦенНоменклатуры");
	ОткрытьФорму("ОбщаяФорма.ФормаНастроекОкругления", ПараметрыФормы,,,,,ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораПравилОкругления(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПорядокОкругления = Результат.ПорядокОкругления;
	ОкруглятьВБольшуюСторону = Результат.ОкруглятьВБольшуюСторону;	

	ИмяКолонкиЦена = "Цена";
	ИмяКолонкиЦенаФото = "ЦенаСФотопечатью";
	
	Для Каждого ТекущаяСтрока Из Объект.Материалы Цикл
		Если ЗначениеЗаполнено(ТекущаяСтрока[ИмяКолонкиЦена]) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидЦены) Тогда
			ТекущаяСтрока[ИмяКолонкиЦена] = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока[ИмяКолонкиЦена], ПорядокОкругления, ОкруглятьВБольшуюСторону);
		КонецЕсли;
		Если ЭтоПотолокОтрез 
			И ЗначениеЗаполнено(ТекущаяСтрока[ИмяКолонкиЦенаФото]) И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВидЦеныСФотопечатью) Тогда
			ТекущаяСтрока[ИмяКолонкиЦенаФото] = ОбщийМодуль.ОкруглитьЧисло(ТекущаяСтрока[ИмяКолонкиЦенаФото], ПорядокОкругления, ОкруглятьВБольшуюСторону);
		КонецЕсли;
	КонецЦикла;
		
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦены(Команда)
	
	Если Объект.Материалы.Количество() = 0 Тогда 
		Сообщить("Таблица пустая, расчет цен не будет выполнен");
		Возврат;
	КонецЕсли;
	
	сз_ВсеВидыЦен = Новый СписокЗначений;
	Для каждого Строка Из ВидыЦен Цикл
		Если НЕ Строка.Запрещенный Тогда
			сз_ВсеВидыЦен.Добавить(Строка.ВидЦены);
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УстановкаИндивидуальныхЦенНаПродукцию",	Истина);
	ПараметрыФормы.Вставить("ВсеВидыЦен",			сз_ВсеВидыЦен);
	ПараметрыФормы.Вставить("ИспользуемыеВидыЦен",	Новый СписокЗначений);
	ПараметрыФормы.Вставить("РазрешенныеВидыЦен",	Новый СписокЗначений);
	 
	ОписаниеОповещения = Новый ОписаниеОповещения("РассчитатьЦеныФрагмент", ЭтотОбъект);
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ФормаРасчетаЦен", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦеныФрагмент(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("РассчитатьЦеныЗавершение", ЭтотОбъект, Результат); 
	ТекстВопроса = "Цены будут перерассчитаны. Продолжить?";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьЦеныЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Истина;
		РассчитатьЦеныНаСервере(ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьЦеныНаСервере(ПараметрыРасчета)
	
	ВидИсходныхДанных = ПараметрыРасчета.ВидИсходныхДанных;
	ИсходныйВидЦен = ПараметрыРасчета.ИсходныйВидЦен;
	ПроцентНаценки = ПараметрыРасчета.ПроцентНаценки;	
	
	ИмяКолонкиПриемник = "Цена";
	ИмяКолонкиПриемникФ = "ЦенаСФотопечатью";
		
	Если ВидИсходныхДанных = 4 Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаЗапроса",?(Объект.Дата = Дата(1,1,1),ТекущаяДатаСеанса(),Объект.Дата));
		Запрос.УстановитьПараметр("ВидЦены", ИсходныйВидЦен);
		Запрос.УстановитьПараметр("Валюта", Объект.Валюта);
		Запрос.УстановитьПараметр("ВидНоменклатуры", Объект.ВидНоменклатуры);
		Запрос.УстановитьПараметр("ТаблицаДокумента", Объект.Материалы.Выгрузить());
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаДокумента.Фактура КАК Фактура,
		|	ТаблицаДокумента.ЦветФактуры КАК ЦветФактуры,
		|	ТаблицаДокумента.Шаблон КАК Шаблон
		|ПОМЕСТИТЬ ВТ_Позиции
		|ИЗ
		|	&ТаблицаДокумента КАК ТаблицаДокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЦеныСрезПоследних.Валюта КАК Валюта,
		|	ЦеныСрезПоследних.ВидЦен КАК ВидЦены,
		|	ЦеныСрезПоследних.Фактура КАК Фактура,
		|	ЦеныСрезПоследних.ЦветФактуры КАК ЦветФактуры,
		|	ЦеныСрезПоследних.Шаблон КАК Шаблон,
		|	ЦеныСрезПоследних.Цена КАК Цена,
		|	ЦеныСрезПоследних.ЦенаСФотопечатью КАК ЦенаСФотопечатью
		|ИЗ
		|	РегистрСведений.ЦеныМатериалов.СрезПоследних(
		|			&ДатаЗапроса,
		|			ВидЦен = &ВидЦены
		|				И Валюта = &Валюта
		|				И ВидНоменклатуры = &ВидНоменклатуры
		|				И (Фактура, ЦветФактуры, Шаблон) В
		|					(ВЫБРАТЬ
		|						ВТ_Позиции.Фактура,
		|						ВТ_Позиции.ЦветФактуры,
		|						ВТ_Позиции.Шаблон
		|					ИЗ
		|						ВТ_Позиции)) КАК ЦеныСрезПоследних";
		ТаблицаИсходныхЦен = Запрос.Выполнить().Выгрузить();
		
		Для Каждого ТекСтрока Из Объект.Материалы Цикл			
			ОтборИсходные = Новый Структура;
			ОтборИсходные.Вставить("Фактура", ТекСтрока.Фактура);
			ОтборИсходные.Вставить("ЦветФактуры", ТекСтрока.ЦветФактуры);
			ОтборИсходные.Вставить("Шаблон", ТекСтрока.Шаблон);
			ТоварыИсходные = ТаблицаИсходныхЦен.НайтиСтроки(ОтборИсходные);
			
			Если ТоварыИсходные.Количество() > 0 Тогда	
				ТекСтрока[ИмяКолонкиПриемник]  = ТоварыИсходные[0].Цена * (1 + ПроцентНаценки/100);
				Если ЭтоПотолокОтрез Тогда
					ТекСтрока[ИмяКолонкиПриемникФ] = ТоварыИсходные[0].ЦенаСФотопечатью * (1 + ПроцентНаценки/100);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры		
		
#КонецОбласти

#Область ОбработчикиСобытийТаблицы

&НаКлиенте
Процедура МатериалыПередУдалением(Элемент, Отказ)
	
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ЭтоПродукция И ЦеныНаПродукциюПоПараметрам Тогда
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;
		
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекущиеДанные.ЕдиницаИзмерения = ОбщийМодульВызовСервера.ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(ТекущиеДанные.Номенклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
	
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;	
	ТекущиеДанные.ВидЦены = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВидЦеныПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;	
	ТекущиеДанные.Цена = 0;
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаСФотопечатьюПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;	
	ТекущиеДанные.ВидЦеныСФотопечатью = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
КонецПроцедуры

&НаКлиенте
Процедура МатериалыВидЦеныСФотопечатьюПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Материалы.ТекущиеДанные;	
	ТекущиеДанные.ЦенаСФотопечатью = 0;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	//Подсветка операции Отмена
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидОперации.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ВидОперации");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
КонецПроцедуры

&НаСервере
Функция УправлениеФормой()
	
	Элементы.МатериалыГруппаЦены.Видимость = НЕ Объект.ВидОперации = Перечисления.ВидыОперацийУстановкиИндивидуальныхЦен.Отмена;
	
	ЭтоПродукция = Ложь;
	Если Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Продукция") Тогда
		ЭтоПродукция = Истина;
		ВидПродукцииЗаполнен = ЗначениеЗаполнено(Объект.ВидПродукции);
	КонецЕсли;

	ЦеныНаПродукциюПоШаблону    = Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоШаблону;
	ЦеныНаПродукциюПоПараметрам = Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоПараметрам;
	ЦеныНаПродукциюПоНоменклатуре = Объект.СпособОпределенияСтоимости = Перечисления.СпособыОпределенияСтоимостиПродукции.ПоНоменклатуре;
	
	ЭтоПотолокОтрез = (Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Потолок")
				       ИЛИ Объект.ВидНоменклатуры = ПредопределенноеЗначение("Справочник.ВидыНоменклатуры.Отрез"));
					   
	Элементы.ВидПродукции.Видимость = ЭтоПродукция;				  
	Элементы.МатериалыГруппаФактура.Видимость 		= ЭтоПотолокОтрез;
	Элементы.МатериалыГруппаЦветФактуры.Видимость   = ЭтоПотолокОтрез;
	Элементы.МатериалыГруппаШаблон.Видимость  		= ЭтоПродукция И ЦеныНаПродукциюПоШаблону;
	Элементы.МатериалыГруппаПараметрыПродукции.Видимость = ЭтоПродукция И ВидПродукцииЗаполнен И ЦеныНаПродукциюПоПараметрам;
	Элементы.МатериалыГруппаНоменклатура.Видимость = ЭтоПродукция И ВидПродукцииЗаполнен И ЦеныНаПродукциюПоНоменклатуре;
	
	Элементы.ГруппаКомандПотолки.Видимость     = ЭтоПотолокОтрез;
	Элементы.ГруппаКомандПоШаблонам.Видимость = ЭтоПродукция И ЦеныНаПродукциюПоШаблону;
	
	Элементы.МатериалыГруппаСпособУточненияЦеныСФотопечатью.Видимость = ЭтоПотолокОтрез И Объект.ЦенаСФотопечатьюОтличается;
	Элементы.МатериалыГруппаСпособУточненияЦены.Заголовок = ?(ЭтоПотолокОтрез, "Способ уточнения цены за кв. м.", "Способ уточнения цены");
	
	//#12615
	Элементы.ЦенаСФотопечатьюОтличается.Видимость = ЭтоПотолокОтрез;
	
КонецФункции

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
